Revit 2024 API
Plane.Normal Property
 Plane normal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public XYZ Normal { get; }
Visual Basic
Public ReadOnly Property Normal As XYZ
	Get
Visual C++
public:
property XYZ^ Normal {
	XYZ^ get ();
}
See Also
Plane Class
Autodesk.Revit.DB Namespace